other_cases/biomethanation_reactor_2025_new/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "alpha.*"
    {
        nAlphaCorr      5;
        nAlphaSubCycles 8;
    }

    bubbles
    {
        nCorr                1;
        tolerance            1e-4;
        scale                true;
        solveOnFinalIterOnly true;
        sourceUpdateInterval 1;
    }

    "p_rgh.*"
    {
        solver          GAMG;
        smoother        DIC;
        tolerance       1e-8;
        relTol          0;
    }

    "(k|omega).*"
    {
        solver          GAMG;
        smoother        symGaussSeidel;
        tolerance       1e-7;
        relTol          0;
        minIter         1;
    }

    "(e|h).*"
    {
        solver          PBiCGStab;
        smoother        GaussSeidel;
        preconditioner  DILU;
        tolerance       1e-12;
        relTol          0;
    }

    "f.*"
    {
        solver          PBiCGStab;
	smoother GaussSeidel;
        preconditioner  DILU;
        tolerance       1e-6;
        relTol          0;
    }

    "Yi.*"
    {
        solver          PBiCGStab;
        smoother GaussSeidel;
        preconditioner  DILU;
        tolerance       1e-12;
        relTol          0;
        residualAlpha   1e-8;
    }

    yPsi
    {
        solver          PCG;
        preconditioner  none;
        tolerance       1e-10;
        relTol          0;
    }
}

/*
PIMPLE
{
    nOuterCorrectors    3;
    nCorrectors         5;
    nNonOrthogonalCorrectors 0;

    faceMomentum        true;

}

relaxationFactors
{
}
*/
PIMPLE
{
    nNonOrthogonalCorrectors 0;
    nCorrectors          5;
    nOuterCorrectors    3;
    faceMomentum true;

    outerCorrectorResidualControl
    {
        U
	{
                tolerance  1e-5;
                relTol      0;
        }
        p_rgh
        {
                tolerance  5e-4;
                relTol      0;
        }
     }
}
 
relaxationFactors
{
    fields
    {
        p_rgh      0.3;
        p_rghFinal   1;
    }
    equations
    {
        "U.gas|U.water|e.gas|e.water"     0.3;
        "(U.gas|U.water|e.gas|e.water)Final"   1;
    }
}
// ************************************************************************* //
